let regex = {
    nom: /^[a-zA-ZÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ\- ]{2,}$/,
    prenom: /^[a-zA-ZÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ\- ]{3,}$/,
    sport: /^[a-zA-ZÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ\- ]{3,}$/,
    age: /^[0-9]{2}$/,
    cp: /^[0-9]{5}$/,
    ville: /^[a-zA-ZÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ\- ]{3,}$/,
    email: /^[a-z0-9\.\-\_]+\@[a-z0-9\-]+\.[a-z]{2,5}$/,
    avatar: /^https?\:\/\/[a-z0-9\.\-\_]+(fbcdn\.net|twimg\.com)[a-z0-9\.\-\_\/]*/,
    bio1: /^[0-9a-zA-ZÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ\-\'\. ]+$/m,
    bio2: /^(?:\w+\W+){9,}(?:\w+[\. ]*)$/m,
    passwd: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[^a-zA-Z0-9]).{8,}$/,
};

